## Plan Result (ithc-frontendappgateway)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.frontendappgateway.azurerm_application_gateway.ag[0]
  * module.frontendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.frontendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.frontendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw"
        name                = "cft-aks-fe-00-ithc-agw"
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
        }
        # (4 unchanged attributes hidden)


      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/paymentoutcome-web"
          ~ name         = "paymentoutcome-web" -> "cft-api-mgmt"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/plum"
          ~ name         = "plum" -> "paymentoutcome-web"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/et-sya"
          ~ name         = "et-sya" -> "plum"
            # (2 unchanged attributes hidden)
        }
      + backend_address_pool {
          + ip_addresses = [
              + "10.11.207.250",
              + "10.11.223.250",
            ]
          + name         = "et-sya"
        }

      ~ backend_http_settings {
            id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/paymentoutcome-web"
          ~ name                                = "paymentoutcome-web" -> "cft-api-mgmt"
          ~ probe_name                          = "paymentoutcome-web" -> "cft-api-mgmt"
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/plum"
          ~ name                                = "plum" -> "paymentoutcome-web"
          ~ probe_name                          = "plum" -> "paymentoutcome-web"
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/et-sya"
          ~ name                                = "et-sya" -> "plum"
          ~ probe_name                          = "et-sya" -> "plum"
            # (7 unchanged attributes hidden)
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + name                                = "et-sya"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_name                          = "et-sya"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }




      ~ http_listener {
          ~ host_name                      = "paymentoutcome-web.ithc.platform.hmcts.net" -> "cft-api-mgmt.ithc.platform.hmcts.net"
            id                             = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/paymentoutcome-web"
          ~ name                           = "paymentoutcome-web" -> "cft-api-mgmt"
            # (7 unchanged attributes hidden)
        }
      ~ http_listener {
          ~ host_name                      = "plum.ithc.platform.hmcts.net" -> "paymentoutcome-web.ithc.platform.hmcts.net"
            id                             = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/plum"
          ~ name                           = "plum" -> "paymentoutcome-web"
            # (7 unchanged attributes hidden)
        }
      ~ http_listener {
          ~ host_name                      = "et-sya.ithc.platform.hmcts.net" -> "plum.ithc.platform.hmcts.net"
            id                             = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/et-sya"
          ~ name                           = "et-sya" -> "plum"
            # (7 unchanged attributes hidden)
        }
      + http_listener {
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_name             = "http"
          + host_name                      = "et-sya.ithc.platform.hmcts.net"
          + name                           = "et-sya"
          + protocol                       = "Http"
        }

      ~ probe {
          ~ host                                      = "paymentoutcome-web.ithc.platform.hmcts.net" -> "cft-api-mgmt.ithc.platform.hmcts.net"
            id                                        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/paymentoutcome-web"
          ~ name                                      = "paymentoutcome-web" -> "cft-api-mgmt"
            # (8 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ probe {
          ~ host                                      = "plum.ithc.platform.hmcts.net" -> "paymentoutcome-web.ithc.platform.hmcts.net"
            id                                        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/plum"
          ~ name                                      = "plum" -> "paymentoutcome-web"
            # (8 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ probe {
          ~ host                                      = "et-sya.ithc.platform.hmcts.net" -> "plum.ithc.platform.hmcts.net"
            id                                        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/et-sya"
          ~ name                                      = "et-sya" -> "plum"
            # (8 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      + probe {
          + host                                      = "et-sya.ithc.platform.hmcts.net"
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "et-sya"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }

      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/adoption-web" -> null
          - backend_address_pool_name  = "adoption-web" -> null
          - backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/adoption-web" -> null
          - backend_http_settings_name = "adoption-web" -> null
          - http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/adoption-web" -> null
          - http_listener_name         = "adoption-web" -> null
          - id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/requestRoutingRules/adoption-web" -> null
          - name                       = "adoption-web" -> null
          - rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/adoption-web"
          + backend_address_pool_name  = "adoption-web"
          + backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/adoption-web"
          + backend_http_settings_name = "adoption-web"
          + http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/adoption-web"
          + http_listener_name         = "adoption-web"
          + id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/requestRoutingRules/adoption-web"
          + name                       = "adoption-web"
          + rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/bar" -> null
          - backend_address_pool_name  = "bar" -> null
          - backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/bar" -> null
          - backend_http_settings_name = "bar" -> null
          - http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/bar" -> null
          - http_listener_name         = "bar" -> null
          - id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/requestRoutingRules/bar" -> null
          - name                       = "bar" -> null
          - rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/bar"
          + backend_address_pool_name  = "bar"
          + backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/bar"
          + backend_http_settings_name = "bar"
          + http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/bar"
          + http_listener_name         = "bar"
          + id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/requestRoutingRules/bar"
          + name                       = "bar"
          + rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/civil-citizen-ui" -> null
          - backend_address_pool_name  = "civil-citizen-ui" -> null
          - backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/civil-citizen-ui" -> null
          - backend_http_settings_name = "civil-citizen-ui" -> null
          - http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/civil-citizen-ui" -> null
          - http_listener_name         = "civil-citizen-ui" -> null
          - id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/requestRoutingRules/civil-citizen-ui" -> null
          - name                       = "civil-citizen-ui" -> null
          - rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/civil-citizen-ui"
          + backend_address_pool_name  = "civil-citizen-ui"
          + backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/civil-citizen-ui"
          + backend_http_settings_name = "civil-citizen-ui"
          + http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/civil-citizen-ui"
          + http_listener_name         = "civil-citizen-ui"
          + id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/requestRoutingRules/civil-citizen-ui"
          + name                       = "civil-citizen-ui"
          + rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/cmc" -> null
          - backend_address_pool_name  = "cmc" -> null
          - backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/cmc" -> null
          - backend_http_settings_name = "cmc" -> null
          - http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/cmc" -> null
          - http_listener_name         = "cmc" -> null
          - id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/requestRoutingRules/cmc" -> null
          - name                       = "cmc" -> null
          - rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/provid

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

9e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/sscs-cor"
          + backend_address_pool_name  = "sscs-cor"
          + backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/sscs-cor"
          + backend_http_settings_name = "sscs-cor"
          + http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/sscs-cor"
          + http_listener_name         = "sscs-cor"
          + id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/requestRoutingRules/sscs-cor"
          + name                       = "sscs-cor"
          + rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/sscs-tribunals" -> null
          - backend_address_pool_name  = "sscs-tribunals" -> null
          - backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/sscs-tribunals" -> null
          - backend_http_settings_name = "sscs-tribunals" -> null
          - http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/sscs-tribunals" -> null
          - http_listener_name         = "sscs-tribunals" -> null
          - id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/requestRoutingRules/sscs-tribunals" -> null
          - name                       = "sscs-tribunals" -> null
          - rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/sscs-tribunals"
          + backend_address_pool_name  = "sscs-tribunals"
          + backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/sscs-tribunals"
          + backend_http_settings_name = "sscs-tribunals"
          + http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/sscs-tribunals"
          + http_listener_name         = "sscs-tribunals"
          + id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/requestRoutingRules/sscs-tribunals"
          + name                       = "sscs-tribunals"
          + rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/xui-approve-org" -> null
          - backend_address_pool_name  = "xui-approve-org" -> null
          - backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/xui-approve-org" -> null
          - backend_http_settings_name = "xui-approve-org" -> null
          - http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/xui-approve-org" -> null
          - http_listener_name         = "xui-approve-org" -> null
          - id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/requestRoutingRules/xui-approve-org" -> null
          - name                       = "xui-approve-org" -> null
          - rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/xui-approve-org"
          + backend_address_pool_name  = "xui-approve-org"
          + backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/xui-approve-org"
          + backend_http_settings_name = "xui-approve-org"
          + http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/xui-approve-org"
          + http_listener_name         = "xui-approve-org"
          + id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/requestRoutingRules/xui-approve-org"
          + name                       = "xui-approve-org"
          + rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/xui-manage-org" -> null
          - backend_address_pool_name  = "xui-manage-org" -> null
          - backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/xui-manage-org" -> null
          - backend_http_settings_name = "xui-manage-org" -> null
          - http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/xui-manage-org" -> null
          - http_listener_name         = "xui-manage-org" -> null
          - id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/requestRoutingRules/xui-manage-org" -> null
          - name                       = "xui-manage-org" -> null
          - rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/xui-manage-org"
          + backend_address_pool_name  = "xui-manage-org"
          + backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/xui-manage-org"
          + backend_http_settings_name = "xui-manage-org"
          + http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/xui-manage-org"
          + http_listener_name         = "xui-manage-org"
          + id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/requestRoutingRules/xui-manage-org"
          + name                       = "xui-manage-org"
          + rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/xui-register-org" -> null
          - backend_address_pool_name  = "xui-register-org" -> null
          - backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/xui-register-org" -> null
          - backend_http_settings_name = "xui-register-org" -> null
          - http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/xui-register-org" -> null
          - http_listener_name         = "xui-register-org" -> null
          - id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/requestRoutingRules/xui-register-org" -> null
          - name                       = "xui-register-org" -> null
          - rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/xui-register-org"
          + backend_address_pool_name  = "xui-register-org"
          + backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/xui-register-org"
          + backend_http_settings_name = "xui-register-org"
          + http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/xui-register-org"
          + http_listener_name         = "xui-register-org"
          + id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/requestRoutingRules/xui-register-org"
          + name                       = "xui-register-org"
          + rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/xui-webapp" -> null
          - backend_address_pool_name  = "xui-webapp" -> null
          - backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/xui-webapp" -> null
          - backend_http_settings_name = "xui-webapp" -> null
          - http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/xui-webapp" -> null
          - http_listener_name         = "xui-webapp" -> null
          - id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/requestRoutingRules/xui-webapp" -> null
          - name                       = "xui-webapp" -> null
          - rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto" -> null
          - rewrite_rule_set_name      = "x_fwded_proto" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/xui-webapp"
          + backend_address_pool_name  = "xui-webapp"
          + backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/xui-webapp"
          + backend_http_settings_name = "xui-webapp"
          + http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/xui-webapp"
          + http_listener_name         = "xui-webapp"
          + id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/requestRoutingRules/xui-webapp"
          + name                       = "xui-webapp"
          + rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "cft-api-mgmt"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "cft-api-mgmt"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "cft-api-mgmt"
          + id                         = (known after apply)
          + name                       = "cft-api-mgmt"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }



        # (144 unchanged blocks hidden)
    }

  # module.frontendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1270,"Program":"tfcmt","SHA1":"","Target":"ithc-frontendappgateway","Vars":{}} -->